
#Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.

#Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для его формирования используйте генератор.
#Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
#Результат: [12, 44, 4, 10, 78, 123].

current_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
print(f'Исходный список:{current_list}')
new_list = [j for i, j in enumerate(current_list) if i != 0 and j > current_list[i-1]]
print(f'Результирующий список:{new_list}')
